Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyMembersReferToOutsideFamily Property
 Memebrs of Family '[Name]' or a nested family thereof illegally refer to Elements outside the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyMembersReferToOutsideFamily { get; }
Public Shared ReadOnly Property FamilyMembersReferToOutsideFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyMembersReferToOutsideFamily {
	FailureDefinitionId^ get ();
}
static member FamilyMembersReferToOutsideFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace